#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
//
//int main() 
//{
//	int i = 0;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//
//	printf("%p\n", &i);
//	printf("%p\n", &arr[9]);
//
//	//for (i = 0; i <= 12; i++)
//	//{
//	//	arr[i] = 0;
//	//	printf("hehe\n");
//	//}
//
//	return 0;
//}
//
//


//整形家族
//浮点型家族
//构造类型-自定义类型
//  数组
//	struct 结构体类型
//  enum 枚举
//  union 联合体
// 
//指针类型
// 
//空类型
//void 
//函数返回类型 void test();
//函数参数 void test(void);
//指针 void* p;

//int main()
//{
//	int arr[10];//int [10]
//	int arr2[5];//int [5]
//	return 0;
//}
//
//
//int main()
//{
//	int a = -10;
//	int b = 10;
//	//00000000000000000000000000001010
//	//0000000a
//	//
//	//10000000000000000000000000001010-原码
//	//11111111111111111111111111110101-反码
//	//11111111111111111111111111110110-补码
//	//FFFFFFF6
//
//	return 0;
//}

//数据在内存中以2进制的形式存储
//对于整数来说：
//整数二进制有3种表示形式:原码、反码、补码
//正整数：原码、反码、补码相同
//负整数：原码、反码、补码要进行计算的
//按照数据的数值直接写出的二进制序列就是原码
//原码的符号位不变，其他位按位取反，得到的就是反码
//反码+1，得到的就是补码
//
//整数中在内存中存储的是补码
//
//
//int main()
//{
//	//1 - 1;
//	//1+(-1)
//	// 
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	//
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001 
//	// 
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010
//	//
//	//-2
//	return 0;
//}
//
//大端字节序和小端字节序
//

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;//int*
//	if (*p == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;//int*
//	return *p;//返回1表示小端，返回0表示大端
//}
//
//int main()
//{
//	//写代码判断当前机器的字节序
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}
//



//输出什么？
#include <stdio.h>
//int main()
//{
//    char a = -1;
//    //10000000000000000000000000000001
//    //11111111111111111111111111111110
//    //11111111111111111111111111111111
//    //11111111
//    //11111111111111111111111111111111
//    signed char b = -1;
//    //11111111
//
//    unsigned char c = -1;
//    //11111111
//    //00000000000000000000000011111111
//    //
//    printf("a=%d,b=%d,c=%d", a, b, c);
//    //-1 -1 255
//
//    return 0;
//}

//补充：
//1. char 到底是signed char 还是unsigned char ?
//C语言标准并没有规定，取决于编译器
//
//int 是 signed int 
//short 是 signed short
//

//
//#include <stdio.h>
//int main()
//{
//    char a = -128;
//    //10000000000000000000000010000000
//    //11111111111111111111111101111111
//    //11111111111111111111111110000000-补码
//    //10000000
//    //11111111111111111111111110000000
//
//    printf("%u\n", a);
//
//    return 0;
//}


//#include <stdio.h>
//int main()
//{
//    char a = 128;
//    //00000000000000000000000010000000 - 原返补相同
//    //10000000
//    //11111111111111111111111110000000
//    //
//    printf("%u\n", a);
//    return 0;
//}

//
//char类型变量的取值范围
//




//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	printf("%u\n", i+j);//?
//	//11111111111111111111111111101100
//	//00000000000000000000000000001010
//	//11111111111111111111111111110110 - 补码
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010 -> -10
//	//
//	return 0;
//}



//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//
//	return 0;
//}

//
//int main()
//{
//    char a[1000];
//    int i;
//    for (i = 0; i < 1000; i++)
//    {
//        a[i] = -1 - i;
//    }
//    //128+127 = 255
//    //-1 -2 -3 ... -127 -128 127 126 125 .. 3 2 1 0 -1 -2 .. -127 -128 127 ...
//    printf("%d\n", strlen(a));//找到\0 -> 0
//    return 0;
//}
//

//char 
//00000000000000000000000010000001
//10000001 - 补码
//10000000 - 反码
//11111111 - 原码
//-127


#include <stdio.h>

//unsigned char i = 0;
//
//int main()
//{
//    for (i = 0; i <= 255; i++)
//    {
//        printf("hello world\n");
//    }
//
//    return 0;
//}
//


#include <limits.h>
//
//int main()
//{
//	INT_MAX;
//	return 0;
//}
//
//

//int main()
//{
//	int n = 9;
//
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0
//
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0
//
//	return 0;
//}
//
//int main()
//{
//	char ch = -129;
//
//	printf("%d\n", ch);
//	return 0;
//}







